# 2108564 Geospatial Data Science and Analysis
## Lecture 5 : Geospatial Database (SQL)
## Done By : 6730084521 Chatrphol Ovanonchai

# SQL
Lecture Slides : [Link Here](https://mycourseville-default.s3.ap-southeast-1.amazonaws.com/useruploaded_course_files/2024_1/56626/materials/Database-15240-17276914815041.pdf)

ตัวอย่างนี้เป็นการสร้างตาราง 2 ตาราง จากตัวอย่างในเว็บ https://en.wikibooks.org/wiki/SQL_Exercises/The_computer_store

##0. เปิดใช้งาน SQLite3

เปิดใช้งานโดยการสร้างไฟล์ชื่อ test.db ไว้เก็บข้อมูล

In [2]:
%load_ext sql

In [3]:
%%sql
sqlite:///test.db

## 1.   สร้าง Table

In [4]:
# CREATING THE TABLE
%%sql

-- Step 1) create Manufaturers table
CREATE TABLE IF NOT EXISTS Manufacturers (
	Code INTEGER PRIMARY KEY NOT NULL,
	Name CHAR(50) NOT NULL
);

-- Step 2) create Products table
CREATE TABLE Products (
	Code INTEGER PRIMARY KEY NOT NULL,
	Name CHAR(50) NOT NULL ,
	Price REAL NOT NULL ,
	Manufacturer INTEGER NOT NULL

		-- Connect Foreign Key (Which will connect to other table)
		CONSTRAINT fk_Manufacturers_Code REFERENCES Manufacturers(Code));

 * sqlite:///test.db
Done.
Done.

[]

In [5]:
## run this command before using SELECT
%config SqlMagic.style = "_DEPRECATED_DEFAULT"

In [6]:
# INSERT VALUES
%%sql
INSERT INTO Manufacturers(Code,Name) VALUES(1,'Sony');
INSERT INTO Manufacturers(Code,Name) VALUES(2,'Creative Labs');
INSERT INTO Manufacturers(Code,Name) VALUES(3,'Hewlett-Packard');
INSERT INTO Manufacturers(Code,Name) VALUES(4,'Iomega');
INSERT INTO Manufacturers(Code,Name) VALUES(5,'Fujitsu');
INSERT INTO Manufacturers(Code,Name) VALUES(6,'Winchester');

INSERT INTO Products(Code,Name,Price,Manufacturer) VALUES(1,'Hard drive',240,5);
INSERT INTO Products(Code,Name,Price,Manufacturer) VALUES(2,'Memory',120,6);
INSERT INTO Products(Code,Name,Price,Manufacturer) VALUES(3,'ZIP drive',150,4);
INSERT INTO Products(Code,Name,Price,Manufacturer) VALUES(4,'Floppy disk',5,6);
INSERT INTO Products(Code,Name,Price,Manufacturer) VALUES(5,'Monitor',240,1);
INSERT INTO Products(Code,Name,Price,Manufacturer) VALUES(6,'DVD drive',180,2);
INSERT INTO Products(Code,Name,Price,Manufacturer) VALUES(7,'CD drive',90,2);
INSERT INTO Products(Code,Name,Price,Manufacturer) VALUES(8,'Printer',270,3);
INSERT INTO Products(Code,Name,Price,Manufacturer) VALUES(9,'Toner cartridge',66,3);
INSERT INTO Products(Code,Name,Price,Manufacturer) VALUES(10,'DVD burner',180,2);

 * sqlite:///test.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [7]:
%%sql
-- Select 2 columns
SELECT Code , Name from Manufacturers

 * sqlite:///test.db
Done.

[(1, 'Sony'),
 (2, 'Creative Labs'),
 (3, 'Hewlett-Packard'),
 (4, 'Iomega'),
 (5, 'Fujitsu'),
 (6, 'Winchester')]

In [8]:
%%sql
-- Summarize Table using PRAGMA
PRAGMA table_info(Manufacturers) -- See that pk in Code is 1 (means that Code column is primary key)

 * sqlite:///test.db
Done.

[(0, 'Code', 'INTEGER', 1, None, 1), (1, 'Name', 'CHAR(50)', 1, None, 0)]

keyword ที่ควรทราบ
* PRIMARY KEY คือ คอลัมน์นั้นห้ามซ้ำ
* NOT NULL คือ ห้ามว่าง
* CONSTRAINT foreign_key_name REFERENCES main_table(key_column) คือสร้าง foreign key โยงสองตารางเข้าด้วยกัน ซึ่งในที่นี้คือให้คอลัมน์ Manufacturer โยงกับ code ในตาราง Manufacturer ผลในการกำหนด foreign key คือ จะไม่อนุญาตให้ทำการเพิ่ม code อื่น ๆ ที่ไม่ได้อยู่ในตาราง Manufacturer
* commit คือการยืนยันคำสั่งก่อนหน้า เราจะสามารถ roll back กลับไปจุด commit ล่าสุดได้ ใช้กับคำสั่ง SQL ประเภท DML

## 2.   ทดลอง query

เลือกทุกแถวทุกคอลัมน์มาจากตาราง

เราสามารถเลือกทุกคอลัมน์ได้โดยใช้เครื่องหมาย *

In [9]:
%%sql
SELECT * FROM Manufacturers;

 * sqlite:///test.db
Done.

[(1, 'Sony'),
 (2, 'Creative Labs'),
 (3, 'Hewlett-Packard'),
 (4, 'Iomega'),
 (5, 'Fujitsu'),
 (6, 'Winchester')]

In [10]:
%%sql
SELECT * FROM Products;

 * sqlite:///test.db
Done.

[(1, 'Hard drive', 240.0, 5),
 (2, 'Memory', 120.0, 6),
 (3, 'ZIP drive', 150.0, 4),
 (4, 'Floppy disk', 5.0, 6),
 (5, 'Monitor', 240.0, 1),
 (6, 'DVD drive', 180.0, 2),
 (7, 'CD drive', 90.0, 2),
 (8, 'Printer', 270.0, 3),
 (9, 'Toner cartridge', 66.0, 3),
 (10, 'DVD burner', 180.0, 2)]

เลือกแค่บางคอลัมน์

In [11]:
%%sql
select Name, Manufacturer from Products;

 * sqlite:///test.db
Done.

[('Hard drive', 5),
 ('Memory', 6),
 ('ZIP drive', 4),
 ('Floppy disk', 6),
 ('Monitor', 1),
 ('DVD drive', 2),
 ('CD drive', 2),
 ('Printer', 3),
 ('Toner cartridge', 3),
 ('DVD burner', 2)]

In [12]:
%%sql
-- Select Text contain in column
SELECT * FROM Products WHERE Name LIKE '%drive' ; -- % is sth before text
-- * is selecting all column

 * sqlite:///test.db
Done.

[(1, 'Hard drive', 240.0, 5),
 (3, 'ZIP drive', 150.0, 4),
 (6, 'DVD drive', 180.0, 2),
 (7, 'CD drive', 90.0, 2)]

In [13]:
%%sql
SELECT Name,Manufacturer FROM Products WHERE Manufacturer <= 2
-- Manufacturer is Column Name , Manufacturers is Table name

 * sqlite:///test.db
Done.

[('Monitor', 1), ('DVD drive', 2), ('CD drive', 2), ('DVD burner', 2)]

เลือกสองตารางมาเชื่อมกัน

In [14]:
%%sql
-- Combine two tables together (which is just connected in code above)
SELECT * FROM Products P , Manufacturers M WHERE M.Code = P.Manufacturer; -- M,P is abbrev name
-- define condition = for not getting all case connected (กันมาเชื่อมกันทุกเคส)

 * sqlite:///test.db
Done.

[(1, 'Hard drive', 240.0, 5, 5, 'Fujitsu'),
 (2, 'Memory', 120.0, 6, 6, 'Winchester'),
 (3, 'ZIP drive', 150.0, 4, 4, 'Iomega'),
 (4, 'Floppy disk', 5.0, 6, 6, 'Winchester'),
 (5, 'Monitor', 240.0, 1, 1, 'Sony'),
 (6, 'DVD drive', 180.0, 2, 2, 'Creative Labs'),
 (7, 'CD drive', 90.0, 2, 2, 'Creative Labs'),
 (8, 'Printer', 270.0, 3, 3, 'Hewlett-Packard'),
 (9, 'Toner cartridge', 66.0, 3, 3, 'Hewlett-Packard'),
 (10, 'DVD burner', 180.0, 2, 2, 'Creative Labs')]

In [15]:
%%sql
-- จริงๆ เราสามารถเปลี่ยนชื่อตารางได้ เเต่มันไม่กระทบ structure เดิม
SELECT P.Code , P.Name , P.Price , M.Name as ManuName from Products P, Manufacturers M WHERE M.Code = P.Manufacturer ;

 * sqlite:///test.db
Done.

[(1, 'Hard drive', 240.0, 'Fujitsu'),
 (2, 'Memory', 120.0, 'Winchester'),
 (3, 'ZIP drive', 150.0, 'Iomega'),
 (4, 'Floppy disk', 5.0, 'Winchester'),
 (5, 'Monitor', 240.0, 'Sony'),
 (6, 'DVD drive', 180.0, 'Creative Labs'),
 (7, 'CD drive', 90.0, 'Creative Labs'),
 (8, 'Printer', 270.0, 'Hewlett-Packard'),
 (9, 'Toner cartridge', 66.0, 'Hewlett-Packard'),
 (10, 'DVD burner', 180.0, 'Creative Labs')]

In [16]:
%%sql
select p.name,p.price,p.manufacturer,m.name from products p, manufacturers m where p.manufacturer=m.code;

 * sqlite:///test.db
Done.

[('Hard drive', 240.0, 5, 'Fujitsu'),
 ('Memory', 120.0, 6, 'Winchester'),
 ('ZIP drive', 150.0, 4, 'Iomega'),
 ('Floppy disk', 5.0, 6, 'Winchester'),
 ('Monitor', 240.0, 1, 'Sony'),
 ('DVD drive', 180.0, 2, 'Creative Labs'),
 ('CD drive', 90.0, 2, 'Creative Labs'),
 ('Printer', 270.0, 3, 'Hewlett-Packard'),
 ('Toner cartridge', 66.0, 3, 'Hewlett-Packard'),
 ('DVD burner', 180.0, 2, 'Creative Labs')]

# 3.ทำโจทย์

1) Select the name of the products with a price less than or equal to $200.

In [17]:
%%sql
SELECT Name FROM Products P WHERE P.Price <= 200

 * sqlite:///test.db
Done.

[('Memory',),
 ('ZIP drive',),
 ('Floppy disk',),
 ('DVD drive',),
 ('CD drive',),
 ('Toner cartridge',),
 ('DVD burner',)]

2) Select all the products with a price between ```$```60 and ```$```120.

In [18]:
%%sql
SELECT * FROM Products P WHERE 60 <= P.Price <= 120
-- USING BETWEEN 60 AND 120 IS BETTER

 * sqlite:///test.db
Done.

[(1, 'Hard drive', 240.0, 5),
 (2, 'Memory', 120.0, 6),
 (3, 'ZIP drive', 150.0, 4),
 (4, 'Floppy disk', 5.0, 6),
 (5, 'Monitor', 240.0, 1),
 (6, 'DVD drive', 180.0, 2),
 (7, 'CD drive', 90.0, 2),
 (8, 'Printer', 270.0, 3),
 (9, 'Toner cartridge', 66.0, 3),
 (10, 'DVD burner', 180.0, 2)]

3) Select the name and price in cents (i.e., the price must be multiplied by 100).

In [19]:
%%sql
SELECT Name , Price * 100 as Price_Cent FROM Products
-- NO NEED TO USE WHERE (CONDITIONAL)

 * sqlite:///test.db
Done.

[('Hard drive', 24000.0),
 ('Memory', 12000.0),
 ('ZIP drive', 15000.0),
 ('Floppy disk', 500.0),
 ('Monitor', 24000.0),
 ('DVD drive', 18000.0),
 ('CD drive', 9000.0),
 ('Printer', 27000.0),
 ('Toner cartridge', 6600.0),
 ('DVD burner', 18000.0)]

4) Compute the average price of all the products.

In [79]:
%%sql
SELECT AVG(Price) as Average_Price
FROM Products

 * sqlite:///test.db
Done.

[(154.1,)]

5) Compute the average price of all products with manufacturer code equal to 2.

In [65]:
%%sql
SELECT AVG(PRICE) as AvgPrice
FROM Products P , Manufacturers M
WHERE (M.Code = P.Manufacturer) AND (P.Manufacturer = 2)

 * sqlite:///test.db
Done.

[(150.0,)]

6) Compute the number of products with a price larger than or equal to $180.

In [22]:
%%sql
SELECT COUNT(Price) as Count_Price_MoreThan180
FROM Products P
WHERE P.Price >= 180

 * sqlite:///test.db
Done.

[(5,)]

7) Select the name and price of all products with a price larger than or equal to $180, and sort first by price (in descending order), and then by name (in ascending order).

In [23]:
%%sql
SELECT Name , Price
FROM Products P
WHERE P.Price >= 180
-- Sort by using ORDER BY ... ASC|DESC
ORDER BY Price DESC , Name ASC

 * sqlite:///test.db
Done.

[('Printer', 270.0),
 ('Hard drive', 240.0),
 ('Monitor', 240.0),
 ('DVD burner', 180.0),
 ('DVD drive', 180.0)]

8) Select all the data from the products, including all the data for each product's manufacturer.

In [51]:
%%sql
SELECT *
FROM Products P , Manufacturers M
WHERE M.Code = P.Manufacturer -- This condition is for inhibiting one-to-many connect

 * sqlite:///test.db
Done.

[(1, 'Hard drive', 240.0, 5, 5, 'Fujitsu'),
 (2, 'Memory', 120.0, 6, 6, 'Winchester'),
 (3, 'ZIP drive', 150.0, 4, 4, 'Iomega'),
 (4, 'Floppy disk', 5.0, 6, 6, 'Winchester'),
 (5, 'Monitor', 240.0, 1, 1, 'Sony'),
 (6, 'DVD drive', 180.0, 2, 2, 'Creative Labs'),
 (7, 'CD drive', 90.0, 2, 2, 'Creative Labs'),
 (8, 'Printer', 270.0, 3, 3, 'Hewlett-Packard'),
 (9, 'Toner cartridge', 66.0, 3, 3, 'Hewlett-Packard'),
 (10, 'DVD burner', 180.0, 2, 2, 'Creative Labs')]

9) Select the product name, price, and manufacturer name of all the products.

In [64]:
%%sql
SELECT P.Name , P.Price , M.Name as ManufacName
FROM Products P , Manufacturers M
WHERE M.Code = P.Manufacturer

 * sqlite:///test.db
Done.

[('Hard drive', 240.0, 'Fujitsu'),
 ('Memory', 120.0, 'Winchester'),
 ('ZIP drive', 150.0, 'Iomega'),
 ('Floppy disk', 5.0, 'Winchester'),
 ('Monitor', 240.0, 'Sony'),
 ('DVD drive', 180.0, 'Creative Labs'),
 ('CD drive', 90.0, 'Creative Labs'),
 ('Printer', 270.0, 'Hewlett-Packard'),
 ('Toner cartridge', 66.0, 'Hewlett-Packard'),
 ('DVD burner', 180.0, 'Creative Labs')]

10) Select the average price of each manufacturer's products, showing only the manufacturer's code.

In [62]:
%%sql
SELECT AVG(Price) as AvgPrice , M.Code as ManufacCode
FROM Products P , Manufacturers M
WHERE M.Code = P.Manufacturer
GROUP BY (Manufacturer)

 * sqlite:///test.db
Done.

[(240.0, 1), (150.0, 2), (168.0, 3), (150.0, 4), (240.0, 5), (62.5, 6)]

11) Select the average price of each manufacturer's products, showing the manufacturer's name.

In [82]:
%%sql
SELECT AVG(Price) as AvgPrice , M.Name as ManufacName
FROM Products P , Manufacturers M
WHERE M.Code = P.Manufacturer
GROUP BY (Manufacturer)

 * sqlite:///test.db
Done.

[(240.0, 'Sony'),
 (150.0, 'Creative Labs'),
 (168.0, 'Hewlett-Packard'),
 (150.0, 'Iomega'),
 (240.0, 'Fujitsu'),
 (62.5, 'Winchester')]

12) Select the names of manufacturer whose products have an average price larger than or equal to $150.

In [95]:
%%sql
SELECT AVG(P.Price) as AvgPrice , M.Name as ManufacName
FROM Products P , Manufacturers M
WHERE (M.Code = P.Manufacturer)
GROUP BY (Manufacturer)
HAVING AVG(P.Price) >= 150
-- HAVING USE AFTER GROUP ALREADY

 * sqlite:///test.db
Done.

[(240.0, 'Sony'),
 (150.0, 'Creative Labs'),
 (168.0, 'Hewlett-Packard'),
 (150.0, 'Iomega'),
 (240.0, 'Fujitsu')]

13) Select the name and price of the cheapest product.

In [103]:
%%sql
SELECT Name , MIN(Price) as MinPrice
FROM Products

 * sqlite:///test.db
Done.

[('Floppy disk', 5.0)]

14) Select the name of each manufacturer along with the name and price of its most expensive product.

In [115]:
%%sql
SELECT P.Name , MAX(P.Price) as MaxPrice , M.Name as ManufacName
FROM Products P , Manufacturers M
WHERE M.Code = P.Manufacturer
GROUP BY (Manufacturer)

 * sqlite:///test.db
Done.

[('Monitor', 240.0, 'Sony'),
 ('DVD drive', 180.0, 'Creative Labs'),
 ('Printer', 270.0, 'Hewlett-Packard'),
 ('ZIP drive', 150.0, 'Iomega'),
 ('Hard drive', 240.0, 'Fujitsu'),
 ('Memory', 120.0, 'Winchester')]

15) Select the name of each manufacturer which have an average price above $145 and contain at least 2 different products.

In [120]:
%%sql
SELECT M.Name as ManufacName , COUNT(M.Name) as CountProduct
FROM Products P , Manufacturers M
WHERE M.Code = P.Manufacturer
GROUP BY (Manufacturer)
HAVING AVG(P.Price) >= 145 AND (CountProduct >= 2)

 * sqlite:///test.db
Done.

[('Creative Labs', 3), ('Hewlett-Packard', 2)]